{
  "menu_descriptions": {
    "1": {
      "name": "Gỏi Ngó Sen Tôm Thịt",
      "category": "Khai vị",
      "price": 85000,
      "description": "Ngó sen giòn ngọt hòa quyện cùng tôm tươi, thịt ba chỉ thái mỏng và nước sốt đặc biệt",
      "detailed_description": "Gỏi ngó sen tôm thịt là món khai vị đặc trưng của ẩm thực miền Nam với hương vị thanh mát, giòn ngọt. Ngó sen tươi được thái mỏng, giòn tan hòa quyện cùng tôm tươi đã luộc chín tới, thịt ba chỉ thái mỏng được luộc mềm. Món ăn được trộn với nước mắm chua ngọt đặc biệt, rắc thêm đậu phộng rang giã nhuyễn và rau thơm tươi mát.",
      "ingredients": [
        "Ngó sen tươi (300g)",
        "Tôm sú tươi (200g)",
        "Thịt ba chỉ (150g)",
        "Cà rốt thái sợi",
        "Rau thơm (húng quế, ngò gai, kinh giới)",
        "Đậu phộng rang",
        "Nước mắm chua ngọt đặc chế"
      ],
      "cooking_method": "Ngó sen được làm sạch, thái mỏng và ngâm nước muối loãng để giữ màu trắng. Tôm luộc với lá chanh và gừng để thơm. Thịt ba chỉ luộc chín, để nguội rồi thái mỏng. Tất cả được trộn đều với nước chấm chua ngọt và rau thơm.",
      "taste_profile": "Vị ngọt tự nhiên của ngó sen, vị umami của tôm thịt, chua ngọt từ nước chấm, thơm mát từ rau thơm",
      "serving_suggestion": "Ăn kèm với bánh tráng nướng hoặc bánh phồng tôm",
      "nutritional_info": "Giàu protein, vitamin C, chất xơ, ít calo - phù hợp cho người ăn kiêng",
      "origin": "Món ăn truyền thống miền Nam, thường xuất hiện trong các bữa cơm gia đình và nhà hàng cao cấp"
    },
    "2": {
      "name": "Chả Giò Phương Nam",
      "category": "Khai vị",
      "price": 75000,
      "description": "Chả giò giòn rụm với nhân tôm thịt, miến và nấm, ăn kèm với rau sống và nước mắm chua ngọt",
      "detailed_description": "Chả giò Phương Nam là món khai vị không thể thiếu trong ẩm thực miền Nam. Lớp vỏ bánh tráng mỏng được cuốn chặt, chiên vàng giòn tan. Nhân chả giò gồm tôm tươi, thịt heo xay, miến dong, nấm mèo, cà rốt thái nhỏ được gia vị đậm đà. Món ăn có màu vàng óng, mùi thơm hấp dẫn.",
      "ingredients": [
        "Bánh tráng Tây Ninh (20 tờ)",
        "Tôm tươi (250g)",
        "Thịt heo xay (200g)",
        "Miến dong (100g)",
        "Nấm mèo (50g)",
        "Cà rốt (1 củ)",
        "Hành tây (1 củ)",
        "Trứng gà (2 quả)",
        "Gia vị: muối, tiêu, nước mắm, đường"
      ],
      "cooking_method": "Tôm tách vỏ, băm nhuyễn. Miến dong ngâm mềm, cắt ngắn. Nấm mèo ngâm nở, thái nhỏ. Tất cả nguyên liệu trộn đều với gia vị, ướp 30 phút. Cuốn chặt trong bánh tráng, chiên ngập dầu với lửa vừa đến khi vàng đều.",
      "taste_profile": "Vỏ giòn tan, nhân đậm đà ngọt thịt, vị umami từ tôm, thơm mùi nấm",
      "serving_suggestion": "Ăn kèm với rau sống (xà lách, húng quế, kinh giới), dưa leo, cà chua và nước mắm chua ngọt",
      "nutritional_info": "Giàu protein, carbohydrate, vitamin A từ cà rốt",
      "origin": "Món ăn có nguồn gốc từ ẩm thực Hoa kiều, được người miền Nam cải tiến theo khẩu vị địa phương"
    },
    "3": {
      "name": "Cá Lóc Nướng Trui",
      "category": "Món chính",
      "price": 185000,
      "description": "Cá lóc tươi nướng trui trên than hoa, phết mỡ hành và ăn kèm với các loại rau thơm đặc trưng miền Nam",
      "detailed_description": "Cá lóc nướng trui là món đặc sản nổi tiếng của miền Nam, đặc biệt là vùng Đồng Tháp Mười. Cá lóc tươi được làm sạch, ướp gia vị đặc biệt rồi nướng trên than hoa đỏ. Trong quá trình nướng, cá được phết mỡ hành thơm lừng, tạo nên lớp da vàng óng, giòn tan. Thịt cá ngọt thịt, thơm mùi khói than.",
      "ingredients": [
        "Cá lóc tươi (1kg)",
        "Mỡ hành (100g)",
        "Hành lá (3 cây)",
        "Tỏi (5 tép)",
        "Ớt (2 quả)",
        "Nước mắm (3 thìa)",
        "Đường (1 thìa)",
        "Tiêu đen"
      ],
      "cooking_method": "Cá lóc làm sạch, rạch dao tạo hình. Ướp với nước mắm, đường, tiêu 30 phút. Mỡ hành phi thơm với tỏi băm. Nướng cá trên than hoa, phết mỡ hành đều khắp thân cá.",
      "taste_profile": "Thịt cá ngọt thanh, da giòn thơm mỡ hành, vị khói than đặc trưng",
      "serving_suggestion": "Ăn kèm với bánh tráng nướng, rau sống đa dạng (xà lách, húng quế, kinh giới, ngò gai), dưa chuột, cà chua và nước chấm mắm nêm",
      "nutritional_info": "Giàu protein chất lượng cao, omega-3, vitamin D, ít chất béo",
      "origin": "Món ăn truyền thống của người dân vùng sông nước miền Nam, đặc biệt phổ biến ở Đồng Tháp"
    },
    "4": {
      "name": "Sườn Nướng Chao",
      "category": "Món chính",
      "price": 165000,
      "description": "Sườn heo ướp chao đỏ, nướng than hoa thơm lừng, ăn kèm với kim chi cải chua và đồ chua",
      "detailed_description": "Sườn nướng chao là món ăn đậm chất miền Nam với hương vị đặc trưng từ chao đỏ. Sườn heo non được cắt miếng vừa ăn, ướp với chao đỏ, mật ong, nước mắm và các gia vị bí truyền. Sau khi ướp thấm, sườn được nướng trên than hoa đỏ, tạo nên màu đỏ bóng hấp dẫn và mùi thơm quyến rũ.",
      "ingredients": [
        "Sườn heo non (800g)",
        "Chao đỏ (3 viên)",
        "Mật ong (2 thìa)",
        "Nước mắm (2 thìa)",
        "Tỏi băm (2 thìa)",
        "Hành tím băm (1 thìa)",
        "Đường (1 thìa)",
        "Dầu ăn (1 thìa)",
        "Tiêu đen xay"
      ],
      "cooking_method": "Sườn rửa sạch, cắt miếng 3cm. Chao đỏ nghiền nhuyễn trộn với mật ong, nước mắm, tỏi, hành tím. Ướp sườn với hỗn hợp này 4-6 giờ. Nướng trên than hoa, trở đều tay để sườn chín đều, không bị cháy.",
      "taste_profile": "Vị ngọt đậm đà từ chao và mật ong, thịt mềm ngọt, thơm mùi khói than",
      "serving_suggestion": "Ăn kèm với cơm trắng, kim chi cải chua, dưa chua và canh chua",
      "nutritional_info": "Giàu protein, vitamin B, sắt, nhưng có hàm lượng chất béo cao",
      "origin": "Món ăn có ảnh hưởng từ ẩm thực Hoa kiều, được người miền Nam sáng tạo với chao đỏ đặc trưng"
    },
    "5": {
      "name": "Lẩu Mắm",
      "category": "Canh & Lẩu",
      "price": 250000,
      "description": "Nước lẩu được nấu từ mắm cá linh, thêm các loại rau đồng và hải sản tươi ngon, tạo nên hương vị đậm đà khó quên",
      "detailed_description": "Lẩu mắm là món ăn đặc trưng nhất của ẩm thực miền Nam, đặc biệt là vùng An Giang. Nước lẩu được nấu từ mắm cá linh thơm đậm, kết hợp với me chua, thơm, cà chua tạo nên vị chua cay đặc trưng. Lẩu có đầy đủ hải sản tươi ngon như tôm, cua, cá, kèm theo các loại rau đồng miền Tây.",
      "ingredients": [
        "Mắm cá linh (200ml)",
        "Tôm sú (300g)",
        "Cua đồng (2 con)",
        "Cá lóc (300g)",
        "Me chua (50g)",
        "Thơm (200g)",
        "Cà chua (3 quả)",
        "Đậu bắp (200g)",
        "Bông điên điển (100g)",
        "Rau muống (200g)"
      ],
      "cooking_method": "Me chua nấu lấy nước. Mắm cá linh pha loãng, lọc bỏ cặn. Thơm, cà chua cắt múi. Nấu nước mắm với me chua, cho thơm, cà chua vào. Thêm hải sản và rau theo thứ tự chín.",
      "taste_profile": "Vị chua cay đặc trưng, đậm đà từ mắm cá, ngọt từ hải sản, thanh mát từ rau đồng",
      "serving_suggestion": "Ăn kèm với bún tươi, rau sống, bánh phồng tôm và nước chấm mắm nêm",
      "nutritional_info": "Giàu protein từ hải sản, vitamin C từ rau củ, probiotics từ mắm lên men",
      "origin": "Món ăn truyền thống của người Khmer và Kinh ở vùng An Giang, Kiên Giang"
    },
    "6": {
      "name": "Lẩu Cá Kèo",
      "category": "Canh & Lẩu",
      "price": 225000,
      "description": "Lẩu cá kèo chua cay với nước dùng đặc biệt nấu từ xương heo và me chua, ăn kèm với rau muống, bông điên điển",
      "detailed_description": "Lẩu cá kèo là món ăn đặc sản của vùng đồng bằng sông Cửu Long. Cá kèo tươi được làm sạch, cắt khúc vừa ăn. Nước lẩu được nấu từ xương heo, me chua, tạo nên vị chua thanh mát. Điểm đặc biệt là cách chế biến cá kèo giữ nguyên độ tươi ngon, thịt cá ngọt thịt không tanh.",
      "ingredients": [
        "Cá kèo tươi (800g)",
        "Xương heo (500g)",
        "Me chua (80g)",
        "Thơm (150g)",
        "Cà chua (2 quả)",
        "Rau muống (200g)",
        "Bông điên điển (150g)",
        "Giá đỗ (100g)",
        "Ngò gai (50g)",
        "Rau răm (30g)"
      ],
      "cooking_method": "Xương heo ninh nước dùng trong 2 giờ. Me chua nấu lấy nước chua. Cá kèo làm sạch, cắt khúc. Thơm, cà chua cắt múi. Nấu nước dùng với nước me, cho cá kèo và rau vào theo thứ tự chín.",
      "taste_profile": "Vị chua nhẹ từ me, ngọt thanh từ cá kèo, đậm đà từ nước dùng xương",
      "serving_suggestion": "Ăn kèm với bún tươi, rau thơm, giá đỗ và tương ớt",
      "nutritional_info": "Giàu protein, omega-3, vitamin D từ cá, chất xơ từ rau",
      "origin": "Món ăn dân dã của ngư dân miền Nam, đặc biệt phổ biến ở Cà Mau, An Giang"
    },
    "7": {
      "name": "Bánh Xèo Miền Tây",
      "category": "Cơm & Bún",
      "price": 95000,
      "description": "Bánh xèo giòn tan với nhân tôm, thịt, giá và đậu xanh, ăn kèm với rau sống và nước mắm chua ngọt",
      "detailed_description": "Bánh xèo miền Tây là món ăn đặc trưng với lớp vỏ bánh màu vàng óng từ bột gạo pha nước cốt dừa và nghệ tươi. Nhân bánh gồm tôm tươi, thịt ba chỉ thái mỏng, giá đỗ và đậu xanh đã nấu chín. Bánh được đổ trên chảo gang nóng, tạo nên độ giòn tan đặc trưng.",
      "ingredients": [
        "Bột gạo (300g)",
        "Nước cốt dừa (400ml)",
        "Nghệ tươi (1 củ)",
        "Tôm tươi (200g)",
        "Thịt ba chỉ (150g)",
        "Giá đỗ (200g)",
        "Đậu xanh (100g)",
        "Hành lá (2 cây)"
      ],
      "cooking_method": "Bột gạo pha với nước cốt dừa, nước nghệ, ủ 2 giờ. Tôm thịt ướp gia vị. Đậu xanh nấu chín. Đổ bột vào chảo nóng, cho nhân vào, đậy nắp để bánh chín giòn.",
      "taste_profile": "Vỏ bánh giòn tan, thơm nước cốt dừa, nhân ngọt từ tôm thịt",
      "serving_suggestion": "Ăn kèm với rau sống đa dạng, bánh tráng và nước mắm chua ngọt",
      "nutritional_info": "Giàu carbohydrate, protein, chất béo tốt từ dừa",
      "origin": "Món ăn truyền thống miền Nam, có nguồn gốc từ ẩm thực Khmer"
    },
    "8": {
      "name": "Cơm Cháy Sườn Rim",
      "category": "Cơm & Bún",
      "price": 125000,
      "description": "Cơm được chiên giòn, ăn kèm với sườn rim mặn ngọt đậm đà, rưới thêm mỡ hành thơm phức",
      "detailed_description": "Cơm cháy sườn rim là món ăn độc đáo của miền Nam. Cơm được ép chặt rồi chiên giòn tạo thành những miếng cơm cháy vàng óng. Sườn heo được rim với nước mắm, đường, tỏi tạo nên vị mặn ngọt đậm đà. Món ăn được rưới thêm mỡ hành thơm phức.",
      "ingredients": [
        "Cơm nguội (500g)",
        "Sườn heo (400g)",
        "Nước mắm (3 thìa)",
        "Đường (2 thìa)",
        "Tỏi (4 tép)",
        "Hành tím (2 củ)",
        "Mỡ hành (50g)",
        "Tiêu đen",
        "Dầu ăn"
      ],
      "cooking_method": "Cơm nguội ép chặt, cắt miếng vuông, chiên giòn vàng. Sườn cắt miếng, rim với nước mắm, đường, tỏi băm đến khi sánh mịn. Mỡ hành phi thơm. Xếp cơm cháy ra đĩa, cho sườn rim lên trên, rưới mỡ hành.",
      "taste_profile": "Cơm giòn tan, sườn mặn ngọt đậm đà, thơm mỡ hành",
      "serving_suggestion": "Ăn kèm với dưa chua, canh chua và rau sống",
      "nutritional_info": "Giàu carbohydrate, protein, nhưng có hàm lượng chất béo cao",
      "origin": "Món ăn sáng tạo từ cơm thừa, phổ biến trong các gia đình miền Nam"
    },
    "9": {
      "name": "Chè Bắp",
      "category": "Tráng miệng",
      "price": 45000,
      "description": "Chè bắp béo ngậy với vị ngọt tự nhiên từ bắp, nước cốt dừa và đậu xanh",
      "detailed_description": "Chè bắp là món tráng miệng truyền thống với vị ngọt thanh từ bắp tươi. Hạt bắp được nấu với nước cốt dừa đặc, tạo nên độ béo ngậy. Thêm đậu xanh đã nấu chín và tapioca trong suốt. Món chè có màu vàng tự nhiên, thơm mùi dừa.",
      "ingredients": [
        "Bắp tươi (3 trái)",
        "Nước cốt dừa (300ml)",
        "Đậu xanh (100g)",
        "Tapioca (50g)",
        "Đường phèn (100g)",
        "Lá dứa (2 lá)",
        "Muối (1/4 thìa)",
        "Nước (500ml)"
      ],
      "cooking_method": "Bắp cạo hạt, xay nhuyễn với ít nước. Đậu xanh nấu chín, nghiền nhuyễn. Tapioca ngâm nở. Nấu nước với đường phèn, lá dứa, cho bắp vào nấu đến khi chín mềm. Thêm đậu xanh, tapioca và nước cốt dừa.",
      "taste_profile": "Ngọt thanh từ bắp, béo ngậy từ nước cốt dừa, thơm lá dứa",
      "serving_suggestion": "Ăn nóng hoặc để nguội, có thể thêm đá viên",
      "nutritional_info": "Giàu vitamin A, chất xơ, carbohydrate tự nhiên",
      "origin": "Món chè truyền thống miền Nam, thường làm trong dịp lễ tết"
    },
    "10": {
      "name": "Nước Sâm Lạnh",
      "category": "Đồ uống",
      "price": 35000,
      "description": "Nước sâm mát lạnh giải nhiệt, nấu từ các loại thảo mộc tự nhiên tốt cho sức khỏe",
      "detailed_description": "Nước sâm lạnh là thức uống giải khát truyền thống được pha chế từ các loại thảo mộc quý như sâm Nam Mỹ, cam thảo, đậu đen. Nước có màu nâu đậm, vị ngọt thanh tự nhiên, có tác dụng giải nhiệt, mát gan, tốt cho sức khỏe.",
      "ingredients": [
        "Sâm Nam Mỹ (20g)",
        "Cam thảo (10g)",
        "Đậu đen (50g)",
        "Hạt chia (10g)",
        "Đường phèn (50g)",
        "Nước (1 lít)",
        "Đá viên",
        "Lá bạc hà (trang trí)"
      ],
      "cooking_method": "Sâm, cam thảo, đậu đen rửa sạch, sắc với nước trong 1 giờ. Lọc bỏ bã, thêm đường phèn khuấy tan. Hạt chia ngâm nở. Để nguội, cho đá và hạt chia vào ly, trang trí lá bạc hà.",
      "taste_profile": "Vị ngọt thanh tự nhiên, hơi đắng nhẹ từ thảo mộc",
      "serving_suggestion": "Uống lạnh, có thể thêm chanh tươi",
      "nutritional_info": "Giàu saponin, vitamin, khoáng chất từ thảo mộc",
      "origin": "Thức uống y học cổ truyền, được người Hoa truyền vào miền Nam"
    },
    "11": {
      "name": "Trà Tắc",
      "category": "Đồ uống",
      "price": 30000,
      "description": "Trà tắc chua ngọt thanh mát, giải khát hiệu quả",
      "detailed_description": "Trà tắc là thức uống giải khát phổ biến với vị chua ngọt hài hòa. Trà đen đậm đà được pha với nước tắc tươi, đường và đá. Món uống có màu nâu đỏ đẹp mắt, mùi thơm của trà hòa quyện với vị chua của tắc.",
      "ingredients": [
        "Trà đen (2 thìa)",
        "Tắc tươi (3 quả)",
        "Đường (2 thìa)",
        "Nước sôi (300ml)",
        "Đá viên",
        "Lá bạc hà (trang trí)",
        "Muối (1 chút)"
      ],
      "cooking_method": "Pha trà đen với nước sôi, để 3 phút rồi lọc bỏ bã. Tắc vắt lấy nước, trộn với đường và chút muối. Trộn nước trà với nước tắc, khuấy đều. Cho đá vào ly, đổ trà tắc, trang trí lá bạc hà.",
      "taste_profile": "Vị đắng nhẹ của trà, chua tươi từ tắc, ngọt vừa phải",
      "serving_suggestion": "Uống lạnh, có thể thêm bạc hà tươi",
      "nutritional_info": "Giàu vitamin C, antioxidant từ trà và tắc",
      "origin": "Thức uống được cải tiến từ trà chanh truyền thống"
    },
    "12": {
      "name": "Gỏi Cuốn Tôm Thịt",
      "category": "Khai vị",
      "price": 75000,
      "description": "Gỏi cuốn tươi mát với tôm, thịt heo, bún và rau thơm, chấm với nước mắm chua ngọt đậm đà",
      "detailed_description": "Gỏi cuốn tôm thịt là món khai vị nhẹ nhàng, tươi mát của ẩm thực miền Nam. Bánh tráng trong suốt được cuốn với tôm luộc tươi ngon, thịt heo luộc thái mỏng, bún tươi và các loại rau thơm như xà lách, húng quế, kinh giới. Món ăn có màu sắc bắt mắt, trong suốt nhìn thấy được nhân bên trong.",
      "ingredients": [
        "Bánh tráng Tây Ninh (20 tờ)",
        "Tôm sú tươi (300g)",
        "Thịt heo luộc (200g)",
        "Bún tươi (200g)",
        "Xà lách (100g)",
        "Húng quế (50g)",
        "Kinh giới (50g)",
        "Chives (20g)"
      ],
      "cooking_method": "Tôm luộc với lá chanh, gừng để khử tanh. Thịt heo luộc chín, thái mỏng. Bún tươi trụng qua nước sôi. Bánh tráng nhúng nước ấm cho mềm, trải phẳng, đặt rau và nhân vào, cuốn chặt tay.",
      "taste_profile": "Tươi mát, ngọt từ tôm thịt, thanh từ rau thơm, dai mềm từ bánh tráng",
      "serving_suggestion": "Ăn kèm với nước mắm chua ngọt pha đậu phộng giã nhuyễn",
      "nutritional_info": "Giàu protein, vitamin từ rau thơm, ít calo, phù hợp ăn kiêng",
      "origin": "Món ăn truyền thống miền Nam, phổ biến trong các bữa ăn gia đình"
    },
    "13": {
      "name": "Canh Chua Cá Lóc",
      "category": "Canh & Lẩu",
      "price": 120000,
      "description": "Canh chua truyền thống với cá lóc tươi, dứa, cà chua, đậu bắp và rau thơm miền Nam",
      "detailed_description": "Canh chua cá lóc là món canh đặc trưng của ẩm thực miền Nam với vị chua thanh mát từ me chua và cà chua. Cá lóc tươi được cắt khúc, nấu với dứa, cà chua, đậu bắp, giá đỗ và rau thơm. Nước canh có màu đỏ cam tự nhiên, vị chua ngọt hài hòa.",
      "ingredients": [
        "Cá lóc tươi (500g)",
        "Me chua (50g)",
        "Dứa tươi (200g)",
        "Cà chua (3 quả)",
        "Đậu bắp (100g)",
        "Giá đỗ (100g)",
        "Ngò gai (50g)",
        "Rau răm (30g)",
        "Hành tím, tỏi"
      ],
      "cooking_method": "Cá lóc làm sạch, cắt khúc, ướp gia vị. Me chua nấu lấy nước. Phi thơm hành tỏi, cho cà chua vào xào, đổ nước me, cho cá và các nguyên liệu khác vào nấu chín.",
      "taste_profile": "Chua thanh từ me và cà chua, ngọt từ cá và dứa, thơm từ rau thơm",
      "serving_suggestion": "Ăn với cơm trắng nóng, có thể thêm tương ớt",
      "nutritional_info": "Giàu protein, vitamin C, omega-3, ít chất béo",
      "origin": "Món canh truyền thống miền Nam, đặc biệt phổ biến ở vùng sông nước"
    },
    "14": {
      "name": "Bún Riêu Cua",
      "category": "Cơm & Bún",
      "price": 85000,
      "description": "Bún riêu cua đồng với nước dùng trong vắt, cua đồng tươi ngon và rau thơm",
      "detailed_description": "Bún riêu cua là món ăn dân dã đặc trưng miền Nam với nước dùng ngọt thanh từ xương heo và cua đồng. Riêu cua được nấu từ cua đồng giã nhuyễn, trứng gà tạo thành những cục riêu vàng óng. Bún tươi được ăn kèm với rau thơm đa dạng.",
      "ingredients": [
        "Bún tươi (300g)",
        "Cua đồng (500g)",
        "Xương heo (300g)",
        "Trứng gà (3 quả)",
        "Cà chua (2 quả)",
        "Mắm ruốc (2 thìa)",
        "Rau muống (100g)",
        "Giá đỗ (100g)",
        "Rau thơm đa dạng"
      ],
      "cooking_method": "Xương heo ninh nước dùng. Cua đồng giã nhuyễn, lọc lấy nước. Trộn nước cua với trứng, nấu thành riêu. Cà chua xào thơm, cho vào nồi nước dùng cùng riêu cua.",
      "taste_profile": "Nước dùng ngọt thanh, riêu cua đậm đà, bún mềm dai",
      "serving_suggestion": "Ăn kèm với rau sống, mắm ruốc và tương ớt",
      "nutritional_info": "Giàu protein, canxi từ cua, vitamin từ rau thơm",
      "origin": "Món ăn dân dã miền Bắc được người miền Nam cải tiến theo khẩu vị địa phương"
    },
    "15": {
      "name": "Bánh Khọt",
      "category": "Khai vị",
      "price": 65000,
      "description": "Bánh khọt giòn rụm với tôm tươi, ăn kèm rau sống và nước mắm chua ngọt",
      "detailed_description": "Bánh khọt là món ăn đặc sản của miền Nam, đặc biệt nổi tiếng ở Vũng Tàu. Bánh được làm từ bột gạo pha nước cốt dừa, đổ vào chảo khọt nhỏ có tôm tươi ở giữa. Bánh có lớp vỏ giòn tan, bên trong mềm mịn, thơm mùi dừa.",
      "ingredients": [
        "Bột gạo (300g)",
        "Nước cốt dừa (200ml)",
        "Tôm tươi (200g)",
        "Hành lá (2 cây)",
        "Nghệ tươi (1 củ)",
        "Muối (1 thìa)",
        "Đường (1 thìa)",
        "Dầu ăn"
      ],
      "cooking_method": "Bột gạo pha với nước cốt dừa, nước nghệ, gia vị, ủ 2 giờ. Tôm tách vỏ, ướp gia vị. Đổ bột vào chảo khọt nóng, cho tôm vào giữa, rắc hành lá, nướng đến khi vàng giòn.",
      "taste_profile": "Vỏ giòn tan, ruột mềm mịn, thơm nước cốt dừa, ngọt từ tôm",
      "serving_suggestion": "Ăn kèm với rau sống, bánh tráng và nước mắm chua ngọt",
      "nutritional_info": "Giàu carbohydrate, protein từ tôm, chất béo tốt từ dừa",
      "origin": "Món ăn đặc sản miền Nam, nổi tiếng nhất ở Vũng Tàu"
    },
    "16": {
      "name": "Cơm Tấm",
      "category": "Cơm & Bún",
      "price": 75000,
      "description": "Cơm tấm sườn nướng với chả trứng, bì và nước mắm chua ngọt đặc trưng",
      "detailed_description": "Cơm tấm là món ăn đặc trưng của Sài Gòn và miền Nam. Cơm tấm có hạt gạo nhỏ, dẻo thơm được ăn kèm với sườn nướng thơm lừng, chả trứng mềm mịn, bì giòn dai và nước mắm chua ngọt đặc biệt. Món ăn đầy đủ dinh dưỡng và hương vị.",
      "ingredients": [
        "Cơm tấm (300g)",
        "Sườn heo (200g)",
        "Trứng gà (2 quả)",
        "Thịt heo (100g)",
        "Da heo (50g)",
        "Dưa chua (50g)",
        "Cà chua (1 quả)",
        "Dưa leo (1 quả)",
        "Nước mắm chua ngọt"
      ],
      "cooking_method": "Sườn ướp gia vị, nướng than hoa. Chả trứng hấp chín. Bì luộc chín, thái sợi trộn với da heo rang giòn. Cơm tấm nấu chín, xới ra đĩa, xếp các món ăn kèm.",
      "taste_profile": "Cơm dẻo thơm, sườn nướng đậm đà, chả trứng mềm mịn, bì giòn dai",
      "serving_suggestion": "Ăn kèm với dưa chua, cà chua, dưa leo và nước mắm chua ngọt",
      "nutritional_info": "Giàu carbohydrate, protein, chất béo, đầy đủ dinh dưỡng",
      "origin": "Món ăn đặc trưng của Sài Gòn, từ thời Pháp thuộc đến nay"
    },
    "17": {
      "name": "Bánh Mì Thịt Nướng",
      "category": "Khai vị",
      "price": 25000,
      "description": "Bánh mì giòn tan với thịt nướng thơm lừng, pate và rau thơm",
      "detailed_description": "Bánh mì thịt nướng là món ăn đường phố đặc trưng của Sài Gòn. Bánh mì Pháp giòn tan được cắt dọc, phết pate, thêm thịt nướng thái mỏng, dưa chua, cà chua, dưa leo và rau thơm. Món ăn có hương vị đậm đà, kết hợp hoàn hảo giữa Đông và Tây.",
      "ingredients": [
        "Bánh mì Pháp (1 ổ)",
        "Thịt heo nướng (100g)",
        "Pate gan (20g)",
        "Dưa chua (30g)",
        "Cà chua (1/2 quả)",
        "Dưa leo (1/4 quả)",
        "Ngò gai (10g)",
        "Tương ớt, mayonnaise"
      ],
      "cooking_method": "Thịt heo ướp gia vị, nướng than hoa thái mỏng. Bánh mì nướng giòn, cắt dọc. Phết pate, mayonnaise, xếp thịt nướng, rau củ và rau thơm vào bánh.",
      "taste_profile": "Bánh giòn tan, thịt nướng đậm đà, pate béo ngậy, rau củ tươi mát",
      "serving_suggestion": "Ăn nóng ngay sau khi làm, có thể thêm tương ớt",
      "nutritional_info": "Giàu carbohydrate, protein, vitamin từ rau củ",
      "origin": "Món ăn đường phố Sài Gòn, kết hợp ẩm thực Pháp và Việt"
    },
    "18": {
      "name": "Hủ Tiếu Nam Vang",
      "category": "Cơm & Bún",
      "price": 55000,
      "description": "Hủ tiếu Nam Vang với nước dùng ngọt thanh, tôm, thịt và gan heo",
      "detailed_description": "Hủ tiếu Nam Vang là món ăn có nguồn gốc từ Campuchia, được người Việt cải tiến. Nước dùng trong vắt được ninh từ xương heo, tôm khô. Hủ tiếu mềm dai ăn kèm với tôm tươi, thịt heo, gan heo, chả cá và rau thơm.",
      "ingredients": [
        "Hủ tiếu khô (300g)",
        "Xương heo (500g)",
        "Tôm khô (50g)",
        "Tôm tươi (150g)",
        "Thịt heo (100g)",
        "Gan heo (50g)",
        "Chả cá (2 miếng)",
        "Hành lá, ngò gai"
      ],
      "cooking_method": "Xương heo, tôm khô ninh nước dùng 2 giờ. Hủ tiếu trụng mềm. Tôm, thịt, gan luộc chín thái mỏng. Múc hủ tiếu vào tô, xếp topping, chan nước dùng nóng, rắc hành lá.",
      "taste_profile": "Nước dùng ngọt thanh, hủ tiếu mềm dai, topping đa dạng",
      "serving_suggestion": "Ăn kèm với giá đỗ, rau thơm và tương ớt",
      "nutritional_info": "Giàu protein, carbohydrate, vitamin từ rau thơm",
      "origin": "Món ăn có nguồn gốc Campuchia, phổ biến ở miền Nam"
    },
    "19": {
      "name": "Bánh Căn",
      "category": "Khai vị",
      "price": 40000,
      "description": "Bánh căn tròn nhỏ giòn tan với tôm, mực và nước chấm đặc biệt",
      "detailed_description": "Bánh căn là món ăn đặc sản của Phan Thiết, Ninh Thuận. Bánh được làm từ bột gạo, nước cốt dừa, đổ vào khuôn tròn nhỏ có tôm, mực ở giữa. Bánh có lớp vỏ giòn tan, ruột mềm mịn, ăn kèm với nước chấm chua ngọt đặc biệt.",
      "ingredients": [
        "Bột gạo (250g)",
        "Nước cốt dừa (150ml)",
        "Tôm tươi (100g)",
        "Mực tươi (100g)",
        "Hành lá (1 cây)",
        "Nghệ tươi (1/2 củ)",
        "Muối, đường",
        "Dầu ăn"
      ],
      "cooking_method": "Bột gạo pha với nước cốt dừa, nước nghệ, gia vị. Tôm mực cắt nhỏ, ướp gia vị. Đổ bột vào khuôn bánh căn nóng, cho tôm mực vào, nướng đến khi vàng giòn.",
      "taste_profile": "Vỏ giòn tan, ruột mềm mịn, thơm nước cốt dừa, ngọt từ hải sản",
      "serving_suggestion": "Ăn kèm với rau sống và nước mắm pha chua ngọt",
      "nutritional_info": "Giàu carbohydrate, protein từ hải sản, chất béo tốt",
      "origin": "Món ăn đặc sản Phan Thiết, Ninh Thuận"
    },
    "20": {
      "name": "Chè Thái",
      "category": "Tráng miệng",
      "price": 35000,
      "description": "Chè Thái đầy màu sắc với thạch, đậu, nước cốt dừa và đá bào",
      "detailed_description": "Chè Thái là món tráng miệng được cải tiến từ chè truyền thống, có màu sắc bắt mắt. Gồm nhiều loại thạch màu sắc khác nhau, đậu đỏ, đậu xanh, sương sáo, nước cốt dừa và đá bào. Món chè mát lạnh, ngọt thanh.",
      "ingredients": [
        "Thạch rau câu đỏ (50g)",
        "Thạch rau câu xanh (50g)",
        "Đậu đỏ (50g)",
        "Đậu xanh (50g)",
        "Sương sáo (30g)",
        "Nước cốt dừa (100ml)",
        "Đường (50g)",
        "Đá bào"
      ],
      "cooking_method": "Đậu đỏ, đậu xanh nấu chín. Thạch rau câu cắt hạt lựu. Sương sáo cắt sợi. Xếp các nguyên liệu vào ly, chan nước cốt dừa pha đường, cho đá bào lên trên.",
      "taste_profile": "Ngọt thanh, mát lạnh, đa dạng texture từ các nguyên liệu",
      "serving_suggestion": "Ăn lạnh, khuấy đều trước khi thưởng thức",
      "nutritional_info": "Giàu carbohydrate, protein từ đậu, vitamin từ thạch rau câu",
      "origin": "Món chè cải tiến hiện đại, phổ biến ở các quán chè miền Nam"
    }
  }
}
